---
kind: method
id: M:Autodesk.Revit.DB.SlabShapeCreaseArray.ForwardIterator
source: html/0a8bfec9-c0a9-ddcf-2ac6-5af5d7d622c1.htm
---
# Autodesk.Revit.DB.SlabShapeCreaseArray.ForwardIterator Method

Retrieve a forward moving iterator to the array.

## Syntax (C#)
```csharp
public virtual SlabShapeCreaseArrayIterator ForwardIterator()
```

## Returns
Returns a forward moving iterator to the array.